AccumulationRegisters/ДанныеОперативногоУчетаРабочегоВремениСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ДанныеОперативногоУчетаРабочегоВремениСотрудников</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПереходящаяЧастьПредыдущейСмены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереходящаяЧастьТекущейСмены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СменыРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчетаВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДанныхУчетаВремениСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СодержимоеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СодержимоеДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСодержитЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СодержитТарифныеСтавки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СодержитЗарплату</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/КадровыйУчетРК/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ПроверитьВозможностьПроведенияПоКадровомуУчетуТаблицыСотрудников(Организация, СотрудникиДаты, ИсключаемыеСсылки, Отказ) Экспорт
	
	ЭтоЮридическоеЛицо = ЗарплатаКадрыПовтИсп.ЭтоЮридическоеЛицо(Организация);
	
	Если ЭтоЮридическоеЛицо Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СотрудникиДаты", СотрудникиДаты);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	&Организация КАК Организация,
		|	СотрудникиДаты.ДатаСобытия,
		|	СотрудникиДаты.Сотрудник,
		|	СотрудникиДаты.ВидСобытия,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаНачала,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТСотрудникиДаты
		|ИЗ
		|	&СотрудникиДаты КАК СотрудникиДаты";
	
	Запрос.Выполнить();
	
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТСотрудникиДаты", "Сотрудник");
	
	Если ТипЗнч(ИсключаемыеСсылки) <> Тип("Массив") Тогда
		ИсключаемыеСсылкиМассив = Новый Массив;
		ИсключаемыеСсылкиМассив.Добавить(ИсключаемыеСсылки);
	Иначе
		ИсключаемыеСсылкиМассив = ИсключаемыеСсылки;
	КонецЕсли;
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистра();
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПостроения.Отборы, "Регистратор", "НЕ В", ИсключаемыеСсылкиМассив);
	
	УстановитьПривилегированныйРежим(Истина);
		
	// физическое лицо ИП не может работать на себя
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Сотрудники.Сотрудник КАК Сотрудник
		|ИЗ
		|	ВТСотрудникиДаты КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО Сотрудники.Организация = Организации.Ссылка
		|ГДЕ
		|	Организации.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
		|	И Сотрудники.Сотрудник.ФизическоеЛицо = Организации.ИндивидуальныйПредприниматель";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ТекстСообщенияПользователю = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Индивидуальный предприниматель %1 не может быть оформлен в свою организацию как сотрудник.'"),
				Выборка.Сотрудник);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстСообщенияПользователю, , , , Отказ);
				
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СторнироватьДанныеОперативногоУчетаКомандировки(ИспарвленныйДокумент) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИспарвленныйДокумент) Тогда
		Возврат;
	КонецЕсли;
		
	ДанныеОперативногоУчетаРабочегоВремениСотрудников = РегистрыНакопления.ДанныеОперативногоУчетаРабочегоВремениСотрудников.СоздатьНаборЗаписей();
	ДанныеОперативногоУчетаРабочегоВремениСотрудников.Отбор.Регистратор.Установить(ИспарвленныйДокумент);
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеОперативногоУчетаРабочегоВремениСотрудников.Записать(Истина);
	УстановитьПривилегированныйРежим(Ложь);
		
КонецПроцедуры

Процедура ВосстановитьДанныеОперативногоУчетаКомандировки(ИспарвленныйДокумент) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИспарвленныйДокумент) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыДляПроведения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИспарвленныйДокумент, "Организация,Сотрудник,ДатаНачала,ДатаОкончания,ВнутрисменнаяКомандировка,ПериодРегистрации,Ссылка,ОплачиватьЧасов,Смена,
																								|ВидРасчета,ПереходящаяЧастьПредыдущейСмены,ПереходящаяЧастьТекущейСмены,ДатаКомандировки,ВидВремениЗамещаемый");
	
	Движения = Новый Структура;
	
	НаборЗаписей = РегистрыНакопления.ДанныеОперативногоУчетаРабочегоВремениСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(РеквизитыДляПроведения.Ссылка);
	
	Движения.Вставить("ДанныеОперативногоУчетаРабочегоВремениСотрудников", НаборЗаписей);
	
	Если Документы.Командировка.НеобходимоРегистрироватьОперативныеДанныеВремени(РеквизитыДляПроведения.ВнутрисменнаяКомандировка) Тогда
		РегистрируемыеДанныеОВремени = Документы.Командировка.ДанныеОВремени(РеквизитыДляПроведения);
		Если РеквизитыДляПроведения.ВнутрисменнаяКомандировка Тогда
			УчетРабочегоВремениРасширенный.ЗарегистрироватьВнутрисменныеОтклонения(Движения, РегистрируемыеДанныеОВремени, РеквизитыДляПроведения.ПериодРегистрации);
		Иначе 
			УчетРабочегоВремени.ПроверитьРегистрируемыеДанныхОВремени(РеквизитыДляПроведения.Ссылка, РегистрируемыеДанныеОВремени, Ложь, Истина);
			УчетРабочегоВремени.ЗарегистрироватьРабочееВремяСотрудников(Движения, РегистрируемыеДанныеОВремени, РеквизитыДляПроведения.ПериодРегистрации);
		КонецЕсли;
	КонецЕсли;

	Если Движения.ДанныеОперативногоУчетаРабочегоВремениСотрудников.Количество() > 0 Тогда
		УстановитьПривилегированныйРежим(Истина);
		Движения.ДанныеОперативногоУчетаРабочегоВремениСотрудников.Записать(Истина);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура КомандировкаПроверитьЗаполнение(Объект, ПроверяемыеРеквизиты, Отказ, РежимИсправления = "РасчетЗарплаты", ПолеПериодРегистрации = "ПериодРегистрации") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ПериодРегистрацииИсправленногоДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ИсправленныйДокумент, ПолеПериодРегистрации);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ПериодРегистрацииИсправленногоДокумента <> НеОпределено Тогда
		Если НЕ ПериодРегистрацииИсправленногоДокумента = Объект[ПолеПериодРегистрации] Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Неверно указан месяц. Месяц исправления должен быть равен месяцу исправляемого документа (%1 г.)'"),
				Формат(ПериодРегистрацииИсправленногоДокумента, "ДФ='ММММ гггг'"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,ПолеПериодРегистрации,,Отказ);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Функция ПредставлениеПричиныУвольнения(СвойстваОснованияУвольнения, ДляКадровогоПриказа = Ложь, ЭтоЕФС1 = Ложь) Экспорт
	
	НормативныйДокумент = КадровыйУчет.НормативныйДокументОснованияУвольненияВРодительномПадеже(СвойстваОснованияУвольнения.ОснованиеУвольнения);
	
	ЧастиПредставленияПунктаСтатьи = Новый Массив;
	
	Если ЗначениеЗаполнено(СвойстваОснованияУвольнения.ОснованиеУвольненияСтатья) Тогда
		ЧастиПредставленияПунктаСтатьи.Добавить(ПредставлениеЧастиПунктаСтатьи(
			СвойстваОснованияУвольнения.ОснованиеУвольненияСтатья, Нстр("ru = 'Статья'")));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвойстваОснованияУвольнения.ОснованиеУвольненияЧасть) Тогда
		ЧастиПредставленияПунктаСтатьи.Добавить(ПредставлениеЧастиПунктаСтатьи(
			СвойстваОснованияУвольнения.ОснованиеУвольненияЧасть, Нстр("ru = 'ч.'")));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвойстваОснованияУвольнения.ОснованиеУвольненияПункт) Тогда
		ЧастиПредставленияПунктаСтатьи.Добавить(ПредставлениеЧастиПунктаСтатьи(
			СвойстваОснованияУвольнения.ОснованиеУвольненияПункт, Нстр("ru = 'п.'"))
			 + ?(НЕ ЗначениеЗаполнено(СвойстваОснованияУвольнения.ОснованиеУвольненияПодпункт), ")", ""));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвойстваОснованияУвольнения.ОснованиеУвольненияПодпункт) Тогда
		ЧастиПредставленияПунктаСтатьи.Добавить(ПредставлениеЧастиПунктаСтатьи(
			СвойстваОснованияУвольнения.ОснованиеУвольненияПодпункт, Нстр("ru = 'пп.'")) + ")");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвойстваОснованияУвольнения.ОснованиеУвольненияАбзац) Тогда
		ЧастиПредставленияПунктаСтатьи.Добавить(ПредставлениеЧастиПунктаСтатьи(
			СвойстваОснованияУвольнения.ОснованиеУвольненияАбзац, Нстр("ru = 'абзац'")));
	КонецЕсли;
	
	ПредставлениеПунктаСтатьи = СтрСоединить(ЧастиПредставленияПунктаСтатьи, " ");
	
	ПредставлениеПричины = СокрЛП(СвойстваОснованияУвольнения.ОснованиеУвольненияТекстОснования);
	Если Не ПустаяСтрока(ПредставлениеПричины) И Не ПустаяСтрока(ПредставлениеПунктаСтатьи) Тогда
		ПредставлениеПричины = ПредставлениеПричины + ", ";
	КонецЕсли;
	
	ПредставлениеПричины = ПредставлениеПричины + ПредставлениеПунктаСтатьи;
	
	Если Не ПустаяСтрока(ПредставлениеПричины) И Не ПустаяСтрока(НормативныйДокумент) Тогда
		
		Если ДляКадровогоПриказа Тогда
			ПредставлениеПричины = ПредставлениеПричины + " ";
		Иначе
			ПредставлениеПричины = ПредставлениеПричины + ", ";
		КонецЕсли;
		
	КонецЕсли;
	
	ПредставлениеПричины = ПредставлениеПричины + НормативныйДокумент;
	
	Если ЭтоЕФС1 Тогда 
		КодПричиныУвольнения = Строка(СвойстваОснованияУвольнения.ПричинаУвольненияПФР);
		ПредставлениеПричины = ?(ПустаяСтрока(ПредставлениеПричины), КодПричиныУвольнения, КодПричиныУвольнения + ", " + ПредставлениеПричины);
	КонецЕсли;
	
	Возврат ПредставлениеПричины;
	
КонецФункции

Процедура ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек) Экспорт
	
	КадровыйЭДО.ДобавитьНастройкуПечатнойФормы(
		ОписанияНастроек,
		Метаданные.ОбщиеМакеты.ПФ_MXL_Т1_ПоПравиламВеденияДО.Имя,
		Перечисления.СодержимоеДокументов.СодержитТарифныеСтавки);
	
	КадровыйЭДО.ДобавитьНастройкуПечатнойФормы(
		ОписанияНастроек,
		Метаданные.ОбщиеМакеты.ПФ_MXL_Т8_ПоПравиламВеденияДО.Имя,
		Перечисления.СодержимоеДокументов.СодержитТарифныеСтавки);
	
КонецПроцедуры

Функция ПредставлениеСтатьиУвольненияДляТ8Краткое(СтатьяУвольнения) Экспорт
	
	Если ТипЗнч(СтатьяУвольнения) <> Тип("СправочникСсылка.ОснованияУвольнения")
		И ТипЗнч(СтатьяУвольнения) <> Тип("СправочникСсылка.ОснованияУвольненияПользовательские") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтатьяУвольнения, "Наименование");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредставлениеЧастиПунктаСтатьи(ЧастьПунктаСтатьи, ПредставлениеПункта)
	
	Если СтрНайти(ВРег(ЧастьПунктаСтатьи), ВРег(НСтр("ru = 'Абзац'"))) = 0 Тогда
		Возврат ПредставлениеПункта + " " + ЧастьПунктаСтатьи;
	КонецЕсли;
	
	Возврат ЧастьПунктаСтатьи;
	
КонецФункции

#КонецОбласти
